package com.totems.totemanimals.resoursesTests

import com.totems.totemanimals.R

object List_Resours_Doshi : ListResourseClass() {

    const val MAX_POINTS = 41
    val BALANCE_LEVEL_MIN = 11.66f
    val BALANCE_LEVEL_MAX = 15.66f
    const val VATA_KEY = "VATA"
    const val PITTA_KEY = "PITTA"
    const val KAPHA_KEY = "KAPHA"

    override val imIdList: Array<Int> = arrayOf(R.drawable.dosha_vata_image, R.drawable.dosha_pitta_image, R.drawable.dosha_kapha_image)

    override val nameIdList: Array<String> = arrayOf("Вата-Доша", "Питта-Доша", "Капха-Доша")

    override val descriptIdList: Array<String> = arrayOf("Практически все физические недомогания прямо или косвенно вызваны нарушением баланса дош, поэтому любое лечение базируется на влиянии на них. Для восстановления внутреннего баланса каждой доше требуется свой терапевтический подход (с учетом пракрити и викрити, конституции с одной, двумя и тремя дошами и степенью дисбаланса, широтой распространения и т. д.).\n" +
            " \n" +
            "Для равновесия Вата-доши главными моментами в повседневной жизни, которые обязательно необходимо учитывать, являются:\n" +
            "•\tправильное питание;\n" +
            "•\tраспорядок дня;\n" +
            "•\tвремя года;\n" +
            "•\tфизическая культура.\n" +
            " \n" +
            "Неадекватное питание - первый по степени важности физический фактор дисбаланса и болезней, а правильный рацион - необходимое условие предотвращения и лечения заболеваний.\n" +
            " \n" +
            "Нижеприведённые рекомендации позволяют уравновесить (сбалансировать) Вата-дошу.\n" +
            " \n" +
            "Балансирование Вата-доши:\n" +
            "•\tПравильный распорядок дня.\n" +
            "•\tПокой.\n" +
            "•\tВнимательное отношение к жидкостям.\n" +
            "•\tПониженная чувствительность к стрессам.\n" +
            "•\tПродолжительный отдых.\n" +
            "•\tТепло.\n" +
            "•\tРегулярное и правильное питание.\n" +
            "•\tМасляный массаж (абхьянга).\n" +
            " \n" +
            " \n" +
            "Поскольку Вата является королевой дош, сбалансировать ее - первостепенная задача каждого. Когда она будет приведена в порядок, то автоматически успокоит и упорядочит Питту и Капху.\n" +
            " \n" +
            "Ключ к состоянию равновесия Ваты - регулярность. Вата-доша очень чувствительна и часто становится жертвой чрезмерного возбуждения. Людей, принадлежащих к этому типу, радует разнообразие, но когда жизнь вокруг них становится слишком бурной и все меняется излишне быстро, их возбуждение переходит в истощение. Поэтому многие люди типа Вата часто находятся в нервном состоянии и изнеможении. Причина их беспокойства в том, что Вата-доша не может более функционировать в таком ритме. Вместо того чтобы регулярно есть, спать и делать зарядку, эти люди хватают еду, когда им вздумается, пропускают ее, занимаются физкультурой лишь время от времени и ложатся спать в самое неподходящее время.\n" +
            " \n" +
            "Такая жизнь не годится ни для одной из дош, но хуже всего она для Ваты. Многие люди, принадлежащие к этому типу, не хотят изменить ее. К сожалению, они приучили себя к мысли, что беспорядочная жизнь ничуть не хуже упорядоченной. Единственное средство - выработать нормальные привычки и обращать немного больше внимания на распорядок жизни.    \n" +
            " \n" +
            "Если у вас появились признаки дисбаланса Ваты, следующие рекомендации помогут вам так построить свой день, чтобы он более благоприятствовал Вата-доше:\n" +
            "Старайтесь побольше отдыхать - это очень важно в случае всех проблем, связанных с Ватой. Почувствовав, что перегружаете себя или переутомляетесь, занимаетесь каким-либо делом (в том числе и умственной деятельностью), остановитесь и передохните в течение пяти минут. Вам крайне необходим и полноценный ночной отдых. Старайтесь не доводить себя до бессонницы, даже если она преследовала вас последние несколько лет. Помимо сна, наилучшим отдыхом является глубокое расслабление, даваемое медитацией. Среди всех дош наиболее полезна она для Ваты, которая полностью восстанавливается и очищается после нескольких минут медитации. Медитация позволяет достичь еще больше, помогая восстановить связь сознания и тела. Это в итоге дает возможность каждому естественному циклу организма пройти полный круг, плавно проследовав через начало, середину и конец. Когда люди типа Вата находятся в таком состоянии постоянно, а не время от времени, они делают огромный шаг вперед в познании своего подлинного «я».\n" +
            " \n" +
            "Пребывайте в тепле: будучи холодной дошей, Вата выигрывает от тепла. Вата также сухая, поэтому стремитесь к тому, чтобы воздух в вашей комнате был достаточно влажным. Советуем, однако, избегать сквозняков, поскольку Вата чрезвычайно чувствительна к движению воздушных масс.\n" +
            " \n" +
            "Необходима такая диета, которая бы успокаивала Вату. Важно также питаться регулярно, поскольку Вата-доша обостряется из-за пустого желудка. Люди типа Вата быстро растрачивают свои силы, когда они чувствуют слабость, то перестают регулярно есть. Они должны питаться три раза в день, даже если их аппетит меняется от раза к разу. Вы непременно должны есть три раза в день, включая теплый, питательный завтрак, состоящий, например, из горячей каши. Немного свежего имбиря помогает поднять аппетит перед едой и улучшает пищеварение.\n" +
            "Чтобы избежать обезвоживания, необходимо пить много теплых жидкостей. Травяной чай для людей типа Вата - наилучший вариант, вы можете пить четыре чашки в день. Избегайте очень холодной еды и напитков.\n" +
            " \n" +
            "Делайте масляный массаж тела по утрам. Эти повседневные аюрведические процедуры называют абхьянга. Принимайте теплую ванну или душ по утрам перед медитацией. Влажное тепло хорошо воздействует на болезненные явления, характерные для Ваты.\n" +
            " \n" +
            "Избегайте умственного напряжения и чрезмерной активности. Громкая музыка, бурные кинофильмы и долгие часы перед телевизором, особенно по вечерам, все это потенциальные раздражители Ваты.\n" +
            " \n" +
            "Сделайте так, чтобы вокруг вас было много света. Вата прекрасно реагирует на солнечный свет и бодрые жизнерадостные цвета. Если вы плохо себя чувствуете, можно посидеть перед закрытым окном. Воспротивьтесь желанию выйти на улицу даже ненадолго, пока вы окончательно не поправитесь.\n" +
            " \n" +
            "Общайтесь с теми, кто вселяет в вас бодрость, читайте веселые книги, смотрите легкие, развлекательные фильмы. Все, что пробуждает в вас естественный энтузиазм, свойственный Вате, и снижает тревогу, чрезвычайно полезно.\n" +
            " \n" +
            "Не пейте алкоголь, когда хотите привести Вату в равновесие, поскольку она несовместима с любыми стимулирующими веществами, включая кофе, чай, никотин. Каждый человек, чувствительный к дисбалансу Ваты, должен обращаться с ними чрезвычайно осторожно. В идеале хорошо 6ы полностью отказаться от них.\n" +
            " \n" +
            "Люди типа Вата зимой нередко страдают сухостью в носу, что способствует частым простудным заболеваниям. Чтобы устранить это явление, капните каплю кунжутного масла на кончик мизинца и аккуратно смажьте им одну ноздрю, проделайте то же самое с другой ноздрей. Затем зажмите нос и начните дышать, потом быстро разожмите его и снова сожмите, чтобы кунжутное масло попало в носовые полости - однако не напрягайтесь и старайтесь не закупоривать пазух. Такой метод особенно успокаивает в сухую, холодную погоду. Многие люди, принадлежащие к типу Вата, замечают, что их сопротивляемость простудным заболеваниям сильно возрастает; кроме того, смягчается слизистая носа, и этот способ могут использовать все, а не только люди, принадлежащие к типу Вата. Лечение можно повторять до двенадцати раз в день. Однако если ваши пазухи заблокированы, не следует злоупотреблять этим методом, масло обострит Капху, что может привести к хроническому воспалению пазух.\n" +
            " \n" +
            " \n" +
            " \n" +
            "Аюрведические Врачи советуют не относиться предвзято к указанным советам. Можно потратить целую жизнь, гоняясь за равновесием, и никогда не достигнуть его, поскольку доши находятся в постоянном движении каждый час, каждый день, каждую минуту. И даже если вы думаете, что работаете над одной из них, другие тоже откликнутся. Если вы съедаете тарелку острой пищи, Питта (горячая доша) возрастает; тогда как Вата и Капха (холодные доши) убывают. Глоток холодной воды снижает Питту, но возбуждает Вату и Капху. Их можно снизить, съев зернышко сладкого укропа, но тогда снова подскочит Питта. Вступая в бесконечные сочетания, доши быстро сменяют друг друга. Доши невозможно уравновесить, как чаши весов и они будут сбалансированы, только находясь в состоянии динамичного равновесия. Изменения и неизменность должны вступать во взаимодействие И тем не менее достижение равновесия — наипростейшая задача, которую легко решить. Природа дала человеку правильные инстинкты для этого, и наши методы лишь помогают раскрыть и обострить их. Не стоит доходить до фанатизма. Каждый день и час происходит диалог между вами, вашим умом и вашим организмом. Научиться понимать этот язык — вершина самопознания.\n",

        "Практически все физические недомогания прямо или косвенно вызваны нарушением баланса дош, поэтому любое лечение базируется на влиянии на них. Для восстановления внутреннего баланса каждой доше требуется свой терапевтический подход (с учетом пракрити и викрити, конституции с одной, двумя и тремя дошами и степенью дисбаланса, широтой распространения и т. д.).\n" +
                " \n" +
                "Для равновесия Питта-доши главными моментами в повседневной жизни, которые обязательно необходимо учитывать, являются:\n" +
                "•\tправильное питание;\n" +
                "•\tраспорядок дня;\n" +
                "•\tвремя года;\n" +
                "•\tфизическая культура.\n" +
                " \n" +
                "Неадекватное питание - первый по степени важности физический фактор дисбаланса и болезней, а правильный рацион - необходимое условие предотвращения и лечения заболеваний.\n" +
                " \n" +
                "Нижеприведенные рекомендации позволяют уравновесить (сбалансировать) Питта-дошу.\n" +
                " \n" +
                "Балансирование Питты:\n" +
                "•\tУмеренность.\n" +
                "•\tПрохлада.\n" +
                "•\tВнимательное отношение к досугу.\n" +
                "•\tЧуткость к естественной красоте.\n" +
                "•\tСочетание отдыха и активности.\n" +
                "•\tСнижение стимуляторов.\n" +
                " \n" +
                " \n" +
                "Ключ к равновесию Питты есть умеренность, дающая уверенность в том, что вы не слишком эксплуатируете себя.\n" +
                "Из всех типов организмов Питте в наибольшей мере свойственны внутренний импульс, агрессия и энергия. Люди, принадлежащие к этому типу, встречают жизненные трудности с открытым забралом и с увлечением принимают вызов, причем более всего их влечет опасность. Но этот внутренний порыв часто является источником их бездействия.\n" +
                " \n" +
                "       Питта дает вам колоссальную энергию, но если вы злоупотребляете ею, она спалит вас дотла. Фанатики труда в этом мире обычно представляют собой людей, у которых Питта выведена из равновесия, особенно если они гневливы и властны. Люди, принадлежащие к типу Питта, должны сознательно обуздывать себя, когда они видят определенные знаки, свидетельствующие об опасности, самыми очевидными из которых являются недостаток ровных эмоций и ровного аппетита. Питте также свойственна любовь к красоте. Среди всех перечисленных пунктов лейтмотивом Питты является следующий вывод: хороша лишь золотая середина. Если вы чувствуете, что ваша Питта находится в состоянии дисбаланса, следующие рекомендации помогут вам привести в равновесие ваш распорядок дня, чтобы он больше соответствовал Питта-доше.\n" +
                " \n" +
                "Найдите время, чтобы отдохнуть от активности а отдых, сменяющийся активностью  это основной ритм жизни для Питта-доши. Поскольку люди этого типа обладают очень большой потребностью в активности, они подчас игнорируют другую сторону цикла. В конце трудового дня вы должны пристать к острову спокойствия. Съешьте легкий ужин, отключите вечером телефон и решительно переборите соблазн взять работу на дом. Для всех нас островок спокойствия поистине кроется в нас самих. Люди с выведенной из равновесия Питтой часто упускают это из виду.\n" +
                " \n" +
                "Прохлада в любом виде помогает противодействовать супер-активной Питте. Добейтесь того, чтобы в вашей спальне температура воздуха была не выше 20° С и не засиживайтесь чрезмерно долго в горячей ванне: слишком высокая влажность может вызвать головокружение или тошноту, когда Питта выведена из равновесия. Если вы чувствуете, что перегрелись, положите холодный компресс на лоб и спину, вместо того чтобы пить слишком много холодной воды. (Ледяная вода, не очень поощряется в Аюрведе) Прохладные, сладкие напитки, если они не слишком раздражающие, тоже очень полезны (яблочный или виноградный сок). Обязательно пейте побольше жидкости в жаркую погоду или если вы чувствуете слабость; люди, принадлежащие к типу Питта, склонны к излишней потливости и в подобных условиях теряют много жидкости. Можно пить специальный травяной аюрведический чай, успокаивающий Питту.\n" +
                " \n" +
                "Медитация очень полезна для восстановления внутреннего спокойствия и равновесия. Она также помогает вам осознать, что отдых есть источник динамической активности. Секрет великих бегунов, в конце концов, не в их большом шаге, а в той гигантской силе, которую они могут сконцентрировать в себе перед тем, как сделать первый шаг. Когда люди типа Питта обнаруживают, что можно достичь огромной силы без всякой агрессии, они делают гигантский шаг в сторону самопознания.\n" +
                " \n" +
                "Придерживайтесь специальной диеты, которая оказывает успокаивающее воздействие на Питту. Очень важно не переедать, к чему склонны многие люди этого типа, если они слишком ускоряют свое превосходное пищеварение. В то же время нельзя все время ощущать неприятный голод - люди типа Питта страдают, если они пропускают еду. Нужны не крайности, а нормальное трехразовое питание в одни и те же часы. Если у вас неустойчивое пищеварение, теплое молоко с сахаром и кардамоном поможет привести Питту в равновесие. Если вы всегда ощущаете повышенный аппетит и чрезмерную жажду, то нужно упорядочить собственное пищеварение, что вам поможет сделать специальная диета для Питты.\n" +
                "Если вы чувствуете, что у вас неудержимый аппетит, не пытайтесь заставить себя есть меньше Вместо этого ешьте небольшими порциями, начиная с трех четвертей того, что вы, как правило, съедаете. Придерживайтесь подобной тактики в течение одного или двух дней, затем перейдите к половине. обычного рациона. Теперь вы съедаете нормальное количество пищи. Продолжайте съедать именно такое количество продуктов до тех пор, пока вы не почувствуете неприятный голод, в таком случае вы должны вернуться к привычному рациону. Если вы съедаете приблизительно две пригоршни еды три раза в день, вы достигли идеала Аюрведы. Этот порядок первоначально был предложен Чаракой, величайшим авторитетом в Аюрведе. Горькая пища обуздывает аппетит больше любой другой, поэтому попытайтесь пить воду с тоником перед едой или съедайте салат из горькой зелени, например, из листьев цикория, фризе, радиккьо или романского салата.\n" +
                " \n" +
                "Не прибегайте к искусственным стимулирующим средствам, каждый из которых обостряет Питту. Алкоголь в любой форме можно уподобить керосину, которым вы поливаете огонь Питты, даже дрожжевая закваска в хлебе не способствует установлению равновесия Питты Не нужно подбрасывать в пищеварительную топку пустые калории алкоголя. Кофеин, содержащийся в кофе и чае, обострит вашу энергию, в то время как вы должны сгладить все острые углы в своей деятельности.\n" +
                " \n" +
                " \n" +
                "Традиционно Аюрведа считает, что лечение слабительными средствами (виречана) - наилучший способ снизить избыток Питты, поскольку очищение желудка на короткое время гасит «пищеварительный огонь». Вы можете пытаться пить одну ложку касторового масла перед сном каждые четыре-шесть недель (но не чаще). Обычно слабительное будит вас три или четыре раза за ночь, после этого вам следует выпить стакан теплой воды, чтобы избежать обезвоживания. На следующий день, когда вы почувствуете некоторую истому и изнеженность, поешьте совсем немного, может быть, несколько стаканов фруктового сока. Если вы будете есть плотную пищу, избегайте всего тяжелого, жирного, холодного или содержащего большое количество масла. Постарайтесь основательно отдохнуть. Однако если у вас боли в кишечнике, кровотечения или длительные неполадки с желудком, избегайте принимать способствующие пищеварению средства.\n" +
                " \n" +
                "Будьте внимательны в отношении пищи, воды и воздуха, поскольку Питта особенно чувствительна к любого рода запрещению. По большому счету, примеси в пище безвредны, но даже небольшое их количество может привести к неправильному обмену, что будет непреодолимым препятствием к достижению абсолютного равновесия.\n" +
                " \n" +
                "Избегайте излишнего физического напряжения или перегрева. Люди, принадлежащие к типу Питта, легко переутомляются от жары. Их светлая кожа плохо реагирует на слишком яркое солнце, и обычно сама подсказывает, когда нужно уйти в тень. Аюрведа советует принимать небольшие солнечные ванны. Начните с десяти минут на открытом солнце и постепенно доведите этот срок до получаса, не забыв при этом смазать кожу специальным защитным лосьоном. Загорать утром и в послеполуденные часы лучше, чем в полдень.\n" +
                " \n" +
                "Постарайтесь как можно больше времени проводить на воздухе; традиционно Аюрведа советует людям, принадлежащим к типу Питта, любоваться закатом, полнолунием, гулять у озер и ручьев. Вообще, красивый пейзаж чрезвычайно благоприятен для людей типа Питта, он привлекает их внимание в значительно большей степени, нежели сидение на крылечке.\n" +
                " \n" +
                "Избегайте читать книги и смотреть фильмы, где идет речь о насилии; они могут слишком глубоко потрясти ваше воображение или вызвать бурные возражения, что сильно обострит Питту. Каждый день находите время для досуга, который поднимет ваше настроение, развлечет и наполнит вас радостью, все это смягчит обостренную Питту. Кроме того, это поможет вам отвлечься от ваших насущных дел, в которые вы ушли с головой и не можете выбраться. Люди этого типа и так слишком серьезны; укрепляющее воздействие смеха необходимо им более чем кому бы то ни было. Можно сказать, что он является лучшим лекарством для обостренной Питты среди всех существующих в природе.\n" +
                " \n" +
                " \n" +
                "Аюрведические Врачи советуют не относиться предвзято к указанным советам. Можно потратить целую жизнь, гоняясь за равновесием, и никогда не достигнуть его, поскольку доши находятся в постоянном движении каждый час, каждый день, каждую минуту. И даже если вы думаете, что работаете над одной из них, другие тоже откликнутся. Если вы съедаете тарелку острой пищи, Питта (горячая доша) возрастает; тогда как Вата и Капха (холодные доши) убывают. Глоток холодной воды снижает Питту, но возбуждает Вату и Капху. Их можно снизить, съев зернышко сладкого укропа, но тогда снова подскочит Питта. Вступая в бесконечные сочетания, доши быстро сменяют друг друга. Доши невозможно уравновесить, как чаши весов и они будут сбалансированы, только находясь в состоянии динамичного равновесия. Изменения и неизменность должны вступать во взаимодействие И тем не менее достижение равновесия — наипростейшая задача, которую легко решить. Природа дала человеку правильные инстинкты для этого, и наши методы лишь помогают раскрыть и обострить их. Не стоит доходить до фанатизма. Каждый день и час происходит диалог между вами, вашим умом и вашим организмом. Научиться понимать этот язык — вершина самопознания.\n" +
                "\n",

        "Практически все физические недомогания прямо или косвенно вызваны нарушением баланса дош, поэтому любое лечение базируется на влиянии на них. Для восстановления внутреннего баланса каждой доше требуется свой терапевтический подход (с учетом пракрити и викрити, конституции с одной, двумя и тремя дошами и степенью дисбаланса, широтой распространения и т. д.).\n" +
                " \n" +
                "Для равновесия Питта-доши главными моментами в повседневной жизни, которые обязательно необходимо учитывать, являются:\n" +
                "•\tправильное питание;\n" +
                "•\tраспорядок дня;\n" +
                "•\tвремя года;\n" +
                "•\tфизическая культура.\n" +
                " \n" +
                "Неадекватное питание - первый по степени важности физический фактор дисбаланса и болезней, а правильный рацион - необходимое условие предотвращения и лечения заболеваний.\n" +
                " \n" +
                "Нижеприведенные рекомендации позволяют уравновесить (сбалансировать) Питта-дошу.\n" +
                " \n" +
                "Балансирование Питты:\n" +
                "•\tУмеренность.\n" +
                "•\tПрохлада.\n" +
                "•\tВнимательное отношение к досугу.\n" +
                "•\tЧуткость к естественной красоте.\n" +
                "•\tСочетание отдыха и активности.\n" +
                "•\tСнижение стимуляторов.\n" +
                " \n" +
                " \n" +
                "Ключ к равновесию Питты есть умеренность, дающая уверенность в том, что вы не слишком эксплуатируете себя.\n" +
                "Из всех типов организмов Питте в наибольшей мере свойственны внутренний импульс, агрессия и энергия. Люди, принадлежащие к этому типу, встречают жизненные трудности с открытым забралом и с увлечением принимают вызов, причем более всего их влечет опасность. Но этот внутренний порыв часто является источником их бездействия.\n" +
                " \n" +
                "       Питта дает вам колоссальную энергию, но если вы злоупотребляете ею, она спалит вас дотла. Фанатики труда в этом мире обычно представляют собой людей, у которых Питта выведена из равновесия, особенно если они гневливы и властны. Люди, принадлежащие к типу Питта, должны сознательно обуздывать себя, когда они видят определенные знаки, свидетельствующие об опасности, самыми очевидными из которых являются недостаток ровных эмоций и ровного аппетита. Питте также свойственна любовь к красоте. Среди всех перечисленных пунктов лейтмотивом Питты является следующий вывод: хороша лишь золотая середина. Если вы чувствуете, что ваша Питта находится в состоянии дисбаланса, следующие рекомендации помогут вам привести в равновесие ваш распорядок дня, чтобы он больше соответствовал Питта-доше.\n" +
                " \n" +
                "Найдите время, чтобы отдохнуть от активности а отдых, сменяющийся активностью  это основной ритм жизни для Питта-доши. Поскольку люди этого типа обладают очень большой потребностью в активности, они подчас игнорируют другую сторону цикла. В конце трудового дня вы должны пристать к острову спокойствия. Съешьте легкий ужин, отключите вечером телефон и решительно переборите соблазн взять работу на дом. Для всех нас островок спокойствия поистине кроется в нас самих. Люди с выведенной из равновесия Питтой часто упускают это из виду.\n" +
                " \n" +
                "Прохлада в любом виде помогает противодействовать супер-активной Питте. Добейтесь того, чтобы в вашей спальне температура воздуха была не выше 20° С и не засиживайтесь чрезмерно долго в горячей ванне: слишком высокая влажность может вызвать головокружение или тошноту, когда Питта выведена из равновесия. Если вы чувствуете, что перегрелись, положите холодный компресс на лоб и спину, вместо того чтобы пить слишком много холодной воды. (Ледяная вода, не очень поощряется в Аюрведе) Прохладные, сладкие напитки, если они не слишком раздражающие, тоже очень полезны (яблочный или виноградный сок). Обязательно пейте побольше жидкости в жаркую погоду или если вы чувствуете слабость; люди, принадлежащие к типу Питта, склонны к излишней потливости и в подобных условиях теряют много жидкости. Можно пить специальный травяной аюрведический чай, успокаивающий Питту.\n" +
                " \n" +
                "Медитация очень полезна для восстановления внутреннего спокойствия и равновесия. Она также помогает вам осознать, что отдых есть источник динамической активности. Секрет великих бегунов, в конце концов, не в их большом шаге, а в той гигантской силе, которую они могут сконцентрировать в себе перед тем, как сделать первый шаг. Когда люди типа Питта обнаруживают, что можно достичь огромной силы без всякой агрессии, они делают гигантский шаг в сторону самопознания.\n" +
                " \n" +
                "Придерживайтесь специальной диеты, которая оказывает успокаивающее воздействие на Питту. Очень важно не переедать, к чему склонны многие люди этого типа, если они слишком ускоряют свое превосходное пищеварение. В то же время нельзя все время ощущать неприятный голод - люди типа Питта страдают, если они пропускают еду. Нужны не крайности, а нормальное трехразовое питание в одни и те же часы. Если у вас неустойчивое пищеварение, теплое молоко с сахаром и кардамоном поможет привести Питту в равновесие. Если вы всегда ощущаете повышенный аппетит и чрезмерную жажду, то нужно упорядочить собственное пищеварение, что вам поможет сделать специальная диета для Питты.\n" +
                "Если вы чувствуете, что у вас неудержимый аппетит, не пытайтесь заставить себя есть меньше Вместо этого ешьте небольшими порциями, начиная с трех четвертей того, что вы, как правило, съедаете. Придерживайтесь подобной тактики в течение одного или двух дней, затем перейдите к половине. обычного рациона. Теперь вы съедаете нормальное количество пищи. Продолжайте съедать именно такое количество продуктов до тех пор, пока вы не почувствуете неприятный голод, в таком случае вы должны вернуться к привычному рациону. Если вы съедаете приблизительно две пригоршни еды три раза в день, вы достигли идеала Аюрведы. Этот порядок первоначально был предложен Чаракой, величайшим авторитетом в Аюрведе. Горькая пища обуздывает аппетит больше любой другой, поэтому попытайтесь пить воду с тоником перед едой или съедайте салат из горькой зелени, например, из листьев цикория, фризе, радиккьо или романского салата.\n" +
                " \n" +
                "Не прибегайте к искусственным стимулирующим средствам, каждый из которых обостряет Питту. Алкоголь в любой форме можно уподобить керосину, которым вы поливаете огонь Питты, даже дрожжевая закваска в хлебе не способствует установлению равновесия Питты Не нужно подбрасывать в пищеварительную топку пустые калории алкоголя. Кофеин, содержащийся в кофе и чае, обострит вашу энергию, в то время как вы должны сгладить все острые углы в своей деятельности.\n" +
                " \n" +
                " \n" +
                "Традиционно Аюрведа считает, что лечение слабительными средствами (виречана) - наилучший способ снизить избыток Питты, поскольку очищение желудка на короткое время гасит «пищеварительный огонь». Вы можете пытаться пить одну ложку касторового масла перед сном каждые четыре-шесть недель (но не чаще). Обычно слабительное будит вас три или четыре раза за ночь, после этого вам следует выпить стакан теплой воды, чтобы избежать обезвоживания. На следующий день, когда вы почувствуете некоторую истому и изнеженность, поешьте совсем немного, может быть, несколько стаканов фруктового сока. Если вы будете есть плотную пищу, избегайте всего тяжелого, жирного, холодного или содержащего большое количество масла. Постарайтесь основательно отдохнуть. Однако если у вас боли в кишечнике, кровотечения или длительные неполадки с желудком, избегайте принимать способствующие пищеварению средства.\n" +
                " \n" +
                "Будьте внимательны в отношении пищи, воды и воздуха, поскольку Питта особенно чувствительна к любого рода запрещению. По большому счету, примеси в пище безвредны, но даже небольшое их количество может привести к неправильному обмену, что будет непреодолимым препятствием к достижению абсолютного равновесия.\n" +
                " \n" +
                "Избегайте излишнего физического напряжения или перегрева. Люди, принадлежащие к типу Питта, легко переутомляются от жары. Их светлая кожа плохо реагирует на слишком яркое солнце, и обычно сама подсказывает, когда нужно уйти в тень. Аюрведа советует принимать небольшие солнечные ванны. Начните с десяти минут на открытом солнце и постепенно доведите этот срок до получаса, не забыв при этом смазать кожу специальным защитным лосьоном. Загорать утром и в послеполуденные часы лучше, чем в полдень.\n" +
                " \n" +
                "Постарайтесь как можно больше времени проводить на воздухе; традиционно Аюрведа советует людям, принадлежащим к типу Питта, любоваться закатом, полнолунием, гулять у озер и ручьев. Вообще, красивый пейзаж чрезвычайно благоприятен для людей типа Питта, он привлекает их внимание в значительно большей степени, нежели сидение на крылечке.\n" +
                " \n" +
                "Избегайте читать книги и смотреть фильмы, где идет речь о насилии; они могут слишком глубоко потрясти ваше воображение или вызвать бурные возражения, что сильно обострит Питту. Каждый день находите время для досуга, который поднимет ваше настроение, развлечет и наполнит вас радостью, все это смягчит обостренную Питту. Кроме того, это поможет вам отвлечься от ваших насущных дел, в которые вы ушли с головой и не можете выбраться. Люди этого типа и так слишком серьезны; укрепляющее воздействие смеха необходимо им более чем кому бы то ни было. Можно сказать, что он является лучшим лекарством для обостренной Питты среди всех существующих в природе.\n" +
                " \n" +
                " \n" +
                "Аюрведические Врачи советуют не относиться предвзято к указанным советам. Можно потратить целую жизнь, гоняясь за равновесием, и никогда не достигнуть его, поскольку доши находятся в постоянном движении каждый час, каждый день, каждую минуту. И даже если вы думаете, что работаете над одной из них, другие тоже откликнутся. Если вы съедаете тарелку острой пищи, Питта (горячая доша) возрастает; тогда как Вата и Капха (холодные доши) убывают. Глоток холодной воды снижает Питту, но возбуждает Вату и Капху. Их можно снизить, съев зернышко сладкого укропа, но тогда снова подскочит Питта. Вступая в бесконечные сочетания, доши быстро сменяют друг друга. Доши невозможно уравновесить, как чаши весов и они будут сбалансированы, только находясь в состоянии динамичного равновесия. Изменения и неизменность должны вступать во взаимодействие И тем не менее достижение равновесия — наипростейшая задача, которую легко решить. Природа дала человеку правильные инстинкты для этого, и наши методы лишь помогают раскрыть и обострить их. Не стоит доходить до фанатизма. Каждый день и час происходит диалог между вами, вашим умом и вашим организмом. Научиться понимать этот язык — вершина самопознания.\n" +
                " \n" +
                "Практически все физические недомогания прямо или косвенно вызваны нарушением баланса дош, поэтому любое лечение базируется на влиянии на них. Для восстановления внутреннего баланса каждой доше требуется свой терапевтический подход (с учетом пракрити и викрити, конституции с одной, двумя и тремя дошами и степенью дисбаланса, широтой распространения и т. д.).\n" +
                " \n" +
                "Для равновесия Капха-доши главными моментами в повседневной жизни, которые обязательно необходимо учитывать, являются:\n" +
                "•\tправильное питание;\n" +
                "•\tраспорядок дня;\n" +
                "•\tвремя года;\n" +
                "•\tфизическая культура.\n" +
                " \n" +
                "Неадекватное питание - первый по степени важности физический фактор дисбаланса и болезней, а правильный рацион - необходимое условие предотвращения и лечения заболеваний.\n" +
                " \n" +
                "Нижеприведенные рекомендации позволяют уравновесить (сбалансировать) Капха-дошу.\n" +
                " \n" +
                "Балансирование Капхи\n" +
                "•\tСтимуляция.\n" +
                "•\tРегулярные физические упражнения.\n" +
                "•\tКонтроль веса.\n" +
                "•\tРазнообразный опыт.\n" +
                "•\tТепло, сухость.\n" +
                "•\tУменьшение потребления сладостей.\n" +
                " \n" +
                " \n" +
                "          Ключ к выравниванию Капха - стимуляция.  От природы Капха-доша - ровная и медлительная, следствием чего является надежность и сила. Но если она вышла из состояния равновесия, Капха слишком крепко держится за статус-кво, поэтому она нуждается в новых зрительных и слуховых ощущениях, новых людях и событиях. То же самое относится ко всем физическим функциям организма. Без активной деятельности люди этого типа становятся замедленными и скучными. Это напрямую связано с их замедленным пищеварением. Как мы видим, когда пища плохо переварена (или если она слишком тяжелая, жирная или ее трудно разжевать), токсичные остатки, называемые ама, могут засорить всю систему и привести к заболеванию. Люди типа Капха особенно склонны к этим нарушениям и должны быть уверены, что у них налажен внутренний теплообмен, чего можно добиться с помощью регулярных упражнений и разнообразной диеты.\n" +
                " \n" +
                "Люди этого типа медленно выходят из равновесия и вновь приходят в это состояние, поэтому лучше все-таки поддерживать постоянный баланс этой доши. Если Вата вышла из строя сегодня, то вы ощутите это уже завтра. Но можно всю зиму есть пищу, которая будет плохо сказываться на Капхе, и испытать пагубное воздействие от нее лишь весной, когда накопленная доша начнет «плавиться», что вызовет у вас типичную весеннюю простуду или воспаление пазух. Если сравните гуны (свойства) Дош, то заметите, что единственное общее свойство у Капхи и Ваты - это холод, поэтому люди, принадлежащие к типам Вата и Капха, испытывают абсолютно противоположные потребности, и метод стимуляции Капхи противоположен регулярному отдыху, в котором нуждается Вата.\n" +
                "Образно говоря, люди типа Вата подобны кроликам, а типа Капха - слонам. Если у вас появились признаки дисбаланса Капхи, следующие советы помогут вам наладить правильный распорядок дня, наиболее благоприятный для вашей ведущей доши:\n" +
                "Ищите разнообразия в жизни. Для Капхи необходимы сознательные усилия для приобретения нового опыта. Люди этого типа ценят семейный очаг, который помогает им избежать ухабов на жизненном пути. Но у них есть явная склонность к инертности, которая нередко приводит к депрессии - бич у многих людей с неуравновешенной Капхой. В этом случае, как, впрочем, и для других дош, может быть очень полезна медитация, она позволяет людям типа Капха обнаружить внутренний живительный источник.\n" +
                " \n" +
                "В сущности, настоящим стимулятором является не внешнее разнообразие, но внутренняя напряженная жизнь. Природа сотворила нас так, чтобы мы все время испытывали живой интерес к новым идеям, новым лицам и творческой деятельности. После краткого медитирования люди этого типа, с радостью глазевшие на парад, неожиданно понимают, что им страстно хочется присоединиться к демонстрантам.\n" +
                "У представителей типа Капха ярко выражен собственнический инстинкт; они любят собирать и копить все, что попадает им под руку, неважно, что это: деньги, энергия, статус или любовь. Когда они понимают что их незаурядная энергия может что-то поменять в жизни, они делают шаг вперед в собственном развитии. Их неистребимое желание любить и быть любимыми возрастает вдвое.\n" +
                " \n" +
                "Если вы принадлежите к типу Капха, то должны придерживаться правильной диеты, вам нельзя переедать, поскольку у вас явная склонность набирать лишний вес. Горячий имбирный чай после еды помогает обострить притупившийся вкус, а также способствует пищеварению (подобно чайной ложке семян фенхеля после еды). Если кровь приливает слишком сильно, то по системе Аюрведы нужно перейти к сухой пище и вяжущим продуктам. Сухие тосты, яблоки, крекер и различные сырые овощи хорошо влияют на пищеварительный тракт и устраняют излишки Капхи. Снизьте потребление сладостей. Капха - единственная доша, которая тесно связана с сахаром. Независимо от количества калорий люди этого типа набирают в весе и выходят из равновесия, если содержание сахара в пище слишком велико. Мороженое, молоко, сладкий десерт, белый хлеб, масло - все, что считается «сладким» по Аюрведе, сильно влияет на организм при насморке, заложенной носоглотке, аллергии и общей вялости, от которой страдают люди типа Капха в состоянии дисбаланса. Чрезмерное потребление сахара в течение долгого времени способствует развитию диабета, серьезной болезни Капхи. С точки зрения Аюрведы существует один-единственный продукт, содержащий сахар - натуральный мед, который не вреден для Капхи. Одна-две ложки меда ежедневно (но не более) помогут избежать переизбытка Капхи.\n" +
                " \n" +
                "Старайтесь находиться в тепле. Будучи холодной дошей, Капха выигрывает от тепла. Если у вас застойные (негнойные) явления, то лучшее лекарство - сухое тепло. Направьте на грудь лампу или сделайте согревающий компресс на спину, что поможет раздраженной Капхе.\n" +
                "Старайтесь избегать влажности. Капха особенно чувствительна к холоду и влаге. Не подвергайте воздействию холодного зимнего воздуха нос, горло и легкие, если вы плохо себя чувствуете. Чтобы улучшить кровообращение, сделайте сухой массаж. Эта процедура называется «гаршана», и ее нужно проводить в специальных шелковых перчатках. Не следует использовать масло, когда Капха находится в обостренном состоянии, поскольку это маслянистая доша. Очень полезно ежедневное растирание всего тела, которое не займет у вас больше пяти-десяти минут. Не переусердствуйте в этой процедуре, чтобы после нее не валиться с ног от усталости. Если у вас нет перчаток, можете использовать мягкую губку.\n" +
                " \n" +
                "В течение дня пейте теплую жидкость, но в умеренных количествах, поскольку Капха и так достаточно влажная доша. Чтобы уменьшить гиперемию и снять боль в горле, хорошо заварить четверть чайной ложки сухого имбиря и куркумы на стакан воды, кроме того, хорошо выпить специальный чай из трав, успокаивающих Капху.\n" +
                " \n" +
                "Регулярно занимайтесь физкультурой. Ежедневные упражнения - один из наилучших способов предотвратить застойные явления в организме и устранить из него токсины. Люди, принадлежащие к этому типу, обладают подлинной силой и хорошо развитой мускулатурой и в молодости являются настоящими атлетами. В зрелости большинство из них становятся малоподвижными. Это прискорбно, так как люди типа Капха выигрывают от упражнений больше, чем представители других дош, и они должны оставаться активными в любом возрасте. Будьте честны с собой, если у вас плохое самочувствие и вам необходимо восстановить силы. У людей типа Капха великолепный запас жизненной энергии, и они отличаются незаурядной активностью. Кроме того, у них достаточно высокий болевой порог, и они не ложатся спать до тех пор, пока окончательно не выбьются из сил. Если вы именно такой человек, спокойно относитесь к тому, что вы плохо себя чувствуете и должны лечь в постель. Возможно, что ваше состояние вдвое тяжелей, чем у большинства людей. Представители этого типа иногда становятся чрезмерно мрачными, если за ними плохо ухаживают, поэтому не стоит противиться тому, чтобы друзья и родственники оказывали вам повышенное внимание, когда вы в плохом состоянии.\n" +
                " \n" +
                " \n" +
                "Аюрведические Врачи советуют не относиться предвзято к указанным советам. Можно потратить целую жизнь, гоняясь за равновесием, и никогда не достигнуть его, поскольку доши находятся в постоянном движении каждый час, каждый день, каждую минуту. И даже если вы думаете, что работаете над одной из них, другие тоже откликнутся. Если вы съедаете тарелку острой пищи, Питта (горячая доша) возрастает; тогда как Вата и Капха (холодные доши) убывают. Глоток холодной воды снижает Питту, но возбуждает Вату и Капху. Их можно снизить, съев зернышко сладкого укропа, но тогда снова подскочит Питта. Вступая в бесконечные сочетания, доши быстро сменяют друг друга. Доши невозможно уравновесить, как чаши весов и они будут сбалансированы, только находясь в состоянии динамичного равновесия. Изменения и неизменность должны вступать во взаимодействие И тем не менее достижение равновесия — наипростейшая задача, которую легко решить. Природа дала человеку правильные инстинкты для этого, и наши методы лишь помогают раскрыть и обострить их. Не стоит доходить до фанатизма. Каждый день и час происходит диалог между вами, вашим умом и вашим организмом. Научиться понимать этот язык — вершина самопознания.\n" +
                "\n")


}