package com.totems.totemanimals.resoursesTests

import com.totems.totemanimals.R

object List_Resours_RCview_Doshi : ListResourseClass() {


    override val imIdList: Array<Int> = arrayOf(R.drawable.dosha_vata_image,R.drawable.dosha_vata_image, R.drawable.dosha_pitta_image, R.drawable.dosha_kapha_image)

    override val nameIdList: Array<String> = arrayOf("Концепция Дош", "Вата-доша", "Питта-доша", "Капха-доша")

    override val descriptIdList: Array<String> = arrayOf(
        "\n\t\t\t\t\t Концепция \n\n" +
                "\n\tКонцепция трёх Дош является основополагающей в Аюрведе. Согласно Аюрведе 5 элементов – Земля, Вода, Огонь, Воздух и Эфир – образуют мироздание. Наше тело также состоит из 5 элементов, которые по-разному сочетаются в организме и образуют особые энергетические комплексы, называемые Доши. Доши непостоянны, под внешним влиянием они могут меняться, их равновесие напрямую зависит от образа жизни, который ведёт человек. Доши – это «нечто, легко выходящее из равновесия». Иными словами, доши образуются пятью элементами: Вата – Воздух и Эфир, Питта – Огонь и Вода, Капха – Вода и Земля. Вата, Питта, Капха – это три типа конституции и три базовые энергии, которые ответственны за все физиологические процессы, происходящие в организме. \n \n" +
                "\n\tКаждый человек имеет свою уникальную конституцию – Пракрити, характеризующуюся определённым соотношением Ваты, Питты и Капхи. Индивидуальная конституция является врождённой и остаётся неизменной всю жизнь. Но воспитание, неправильное питание, образ жизни, привычки, влияние социума и внешней среды нарушают гармонию внутренней природы человека и ухудшают её. В результате чего возникает дисбаланс Дош, называемый Викрити. Викрити – текущее состояние нашей конституции. Викрити поддаётся корректировке при помощи изменения питания, образа жизни, физических нагрузок, влияния окружающей среды и т.д. Если Викрити совпадает с Пракрити, то у человека безупречное здоровье. Зная свою Пракрити можно проводить лечение, направленное на восстановление и поддержание необходимого баланса дош. С помощью специальных тестов можно вычислить текущее соотношение Дош в организме. Такие тесты можно найти на просторах интернета. Лучше пройти тест на нескольких сайтах и сравнить результаты. Зная собственные Пракрити и Викрити можно определять и корректировать состояние своего здоровья. Постепенно вы научитесь чувствовать своё тело и определять какая из дош ослабляется, а какая – усиливается и сразу же восстанавливать их баланс.\n\n" +
                "\tРавновесие и баланс трёх Дош даёт человеку здоровую, долгую, гармоничную и счастливую жизнь. Но если нарушается равновесие Дош, это приводит к возникновению болезней и разрушению тела.\n\n" +
                "\n" +
                "\n\tС точки зрения Аюрведы, для лечения болезни первым делом нужно определить индивидуальную конституцию человека, с рождения заложенную природой, и вернуть в исходное положение вышедшие из равно¬весия Доши. Организм находится в балансе, когда существует Тридоша баланс. Болезнь начинается, когда одна или две Доши значительно отклоняются от своего равновесия. Нужно стремиться к уравновешиванию тех Дош, которые выходят из-под контроля и начинают доминировать.\n\n" +
                "\n\tУ некоторых людей явно преобладает какая-либо одна Доша, и их можно причислить к типам чистой Ваты, чистой Питты или чистой Капхи. Чаще встречаются смешанные типы, когда в человеке присутствуют две или три доши примерно в одинаковой степени. Это двойственные типы: Вата-Питта (Воздух-Огонь), Вата-Капха (Воздух-Вода), Питта-Капха (Огонь-Вода). Тройственный тип: Вата-Питта-Капха встречается достаточно редко. Таким образом, насчитывается 7 основных типов конституции.\n\n" +
                "\n\tВы можете достичь прекрасного здоровья и жить в гармонии с собой, соблюдая соответствующую диету для вашего типа конституции, ведя подходящий вам образ жизни, а также занимаясь спортом.\n\n" +
                "\n\tКаждый тип обладает своими отличительными особенностями, которые проявляются в поведении, физических характеристиках, состоянии здоровья, внешнем виде.\n\n"
        ,
        "\n\t\t\t\t\t Вата-Доша \n\n" +
                "\n" +
                "\n\tВата - самая сильная, активная и подвижная из всех Дош, но она обладает и наибольшим потенциалом порождения болезни. Людям с Вата-типом следует обратить особое внимание на питание, образ жизни и влияния окружающей среды.\n\n" +
                "\n\tФизиологический портрет \n\n" +
                "\n\tЛюди типа Вата недостаточно развиты физически. У них тонкая кость, плоская грудь, слабо выраженные мускулы, удлинённые ноги с узкими лодыжками. Кожа коричневого оттенка, тонкая, шершавая, холодная, сухая или потрескавшаяся, склонная к рано появляющимся морщинам. У Вата-типа на коже обычно много родинок и видны проступающие вены. Люди Вата-типа хрупкого телосложения, с выделяющимися суставами из-за неразвитости мышц. Они либо высокого, либо низкого роста, с маленькой головой. Волосы у них редкие, тонкие, обычно вьющиеся, ресницы короткие, губы тонкие, часто холодные руки и стопы.\n\n" +
                "\n" +
                "\n\tВаты характеризуются изменчивым аппетитом и пищеварением. Порой люди Вата-типа съедают огромное количество еды, а иногда аппетит и вовсе отсутствует. Имеют относительно стабильный вес, редко потеют, склонны к запорам. Сон может быть беспокойным, не глубоким.\n\n" +
                "\n" +
                "\n\tПсихологический портрет\n\n" +
                "\n" +
                "\n\tОбычно люди с Вата-конституцией творческие, деятельные, активные, непредсказуемые, впечатлительные, открытые, мечтательные. У этих людей нестандартный взгляд на жизнь с отсутствием шаблонов. Они остроумны, энергичны, быстро говорят и ходят, но могут легко терять силы и уставать. Они отличаются быстрой сообразительностью, но при этом у них часто бывает плохая память, и они могут быть рассеянными.\n\n" +
                "\n" +
                "\n\tЛюди Вата-типа ощущают потребность к перемене мест и непрекращающейся работе, они любят новизну и исследовать неизвестное. Они легко приспосабливаются к переменам, но часто могут проявлять нерешительность и нетерпение. Им необходимо развивать уверенность в себе, терпение и смелость. Такие люди много размышляют, излишне тревожатся и волнуются, часто нервничают и страдают от беспокойства и страхов за будущее, что является причиной метаний. Это один из ярких примеров дисбаланса данной Доши.\n" +
                "Ваты обладают огромным потенциалом к духовной жизни, развитию и совершенствованию себя, они чутки и тяготеют к высоким искренним чувствам.\n\n" +
                "\n\tПитание\n\n" +
                "\n" +
                "\n\t Вата – сухая, холодная, лёгкая и подвижная, поэтому её надо приземлять, увлажнять, согревать, уменьшать гиперактивность и увеличивать вес.\n \n" +
                "\n" +
                "\n\t Людям Вата-типа особенно важно регулярное и достаточное питание, так как Вата-доша легко выходит из равновесия при пустом желудке, поэтому необходимо соблюдать строгий режим с четырёхразовым питанием.\n" +
                "Для Ваты благоприятны естественный сладкий, кислый и солёный вкусы. Как можно меньше и реже употреблять острые, горькие и вяжущие продукты. Пища должна быть тёплая, увлажняющая, маслянистая, тяжёлая и питательная. \n\n" +
                "\n\t Завтрак должен быть плотным и сытным с преобладаем натуральных сладостей. Для Ваты на завтрак хорошо кушать горячие каши с сухофруктами с добавлением кокосового масла. Обед должен быть основным приёмом пищи, примерно такой же, как и завтрак, только больший по объёму. Перед обедом нужно выпить небольшими глотками стакан тёплой воды или травяного чая. Можно съесть кусочек имбиря для активизации пищеварения, а ещё лучше смесь из имбиря, мёда и лимона. Горячая каша из зерновых и бобовых на обед хорошо сдобренная специями и с достаточным количеством масла — полезное и необходимое блюдо для людей с обострением Ваты. Вместо салата из свежих овощей лучше съесть густой горячий суп-пюре с хлебом. Вечером перекусить можно черносливом с кешью, другими орехами, кокосом, халвой из семечек или орехов. Ужин должен быть лёгким и тёплым. Для Ваты идеально подходят тушёные овощи, густые овощные супы-пюре, зелёная гречка с овощами, киноа с овощами.\n\n" +
                "\n" +
                "\n\t Следует избегать холодную, сухую, лёгкую, старую и пережаренную пищу. У людей типа Вата часто неустойчивое пищеварение, им помогают мягкие, легко перевариваемые блюда. Салаты из сырых овощей и зелени лучше включать в рацион летом, они должны быть комнатной температуры и заправлены растительным маслом.\n \n" +
                "\n" +
                "\n\t Если вы что-то съели и почувствовали, что замёрзли, обязательно съешьте что-то согревающее, например, имбирь или попейте кипятка или горячий чай. Обязательно поделайте упражнения, чтобы согреться - поприседайте, походите на носочках, покрутите плечами, руками. Поднимание и опускание себя на носочках очень хорошо согревает. В этом упражнении хорошо напрягаются икроножные мышцы, после чего тепло распространяется по всему телу. Поделайте змейку спиной. Прогибая спину, опускайтесь вниз, слегка сгибая колени, руками скользите по ногам, а затем, округляя спину медленно поднимайтесь вверх. В этом упражнении улучшается кровообращение позвоночника, после чего организм согревается. \n\n" +
                "\n" +
                "\n\tИз-за крайней чувствительности, Вате не стоит отвлекаться во время приёма пищи на посторонние вещи (чтение, телевизор, разговоры). Благоприятно кушать, сконцентрировавшись на еде, слушая приятную спокойную музыку.\n\n" +
                "\n" +
                "\n\t Перед сном благоприятно выпить стакан тёплого молока с мёдом и специями: куркумой, кардамоном, фенхелем и мускатным орехом. При бессоннице - молоко с душистым перцем и гвоздикой.\n\n"
        ,
        "\n\t\t\t\t\t Питта-Доша \n\n" +
                "\n\t Питта - это вторая по активности Доша, которая выходит значительно реже из равновесия, чем Вата. Однако её дисбаланс может привести к серьёзным проблемам.\n\n" +
                "\n\t Я - огонь пищеварения в телах всех живых существ, и вместе с входящим в тело и выходящим из него воздухом Я помогаю живым существам переваривать пищу четырех видов. \n\n" +
                "\n\t Физиологический портрет\n\n" +
                "\n\t Люди типа Питта отличаются превосходным и пропорциональным телосложением, обычно имеют средний рост, умеренное развитие мышц, средней длины конечности, узкая талия и средней толщины кисти. \n\n" +
                "\n\t Кожа желтоватого или медного цвета, мягкая, тонкая, блестящая и маслянистая. Они легко краснеют, могут иметь много родинок или веснушек. Волосы - тонкие, шелковистые, рыжеватые или каштановые, с тенденцией к ранней седине или облысению. Глаза светлые, слегка выпуклые, острый нос и острые зубы. \n\n" +
                "\n\t У людей Питта-конституции сильно потеют, имеют всегда тёплые руки и ноги, температура тела у них высокая, легко набирают и также легко сбрасывают вес. Они плохо переносят жару и солнечный свет. \n\n" +
                "\n\t Люди типа Питта обладают отличным аппетитом, хорошим пищеварением и метаболизмом. Обычно они едят пищу в большом количестве и любят холодные напитки. Сон средней продолжительности, без пробуждений. \n\n" +
                "\n\t Психологический портрет\n\n" +
                "\n\t Люди типа Питты быстро всё схватывают, имеют острый интеллект, исследовательский ум, могут быть хорошими ораторами. Эти люди властны, целеустремлённы, честолюбивы, темпераментны, энергичны и амбициозны. Отличаются пунктуальностью, надёжностью, смелостью, приветливостью. Часто Питты наслаждаются своим авторитетом, контролируют все происходящие события и твёрдым шагом идут к успеху. Они умеют сконцентрироваться на одной задаче и бросить все силы на её выполнение. \n\n" +
                "\n\t Если Питта стабилизирована, человек пребывает в приподнятом настроении и ясно мыслит. Если же нет, то человек может мгновенно выйти из себя, а разбушевавшуюся Питту усмирить очень непросто. Питта-тип склонен к гневу, раздражительности, ревности, возможно, ненависти. \n\n" +
                "\n\t Питание\n\n" +
                "\n\t Питта - это огненная доша, поэтому её надо уравновешивать прохладной или тёплой пищей, но не горячей. Пища должна быть не очень маслянистая и в меру питательная. Людям Питта-типа, больше чем людям других типов конституций полезно вегетарианство. Людям этого типа рекомендуется пища с горьким, вяжущим, немного сладким вкусом. В рационе Питты должны преобладать овощи, фрукты, зерновые и бобовые. \n\n" +
                "\n\t У людей типа Питта очень хорошее пищеварение и отличный аппетит. Они могут есть практически всё что угодно, но конечно, в разумных пределах. Людям Питта-типа важна регулярность в приёме пищи, они не должны пропускать ни одного приёма пищи. Как только у Питты обостряется чувство голода, им непременно следует его утолять, не откладывая. Иначе Питта проявляет раздражительность и агрессию. Людям типа Питты противопоказаны длительные голодания. Можно устраивать разгрузочные дни на сырых овощах и фруктах. Из всех дош только Питта неплохо переносит сыроедение. \n\n" +
                "\n\t Завтрак должен быть достаточным, но не обильным. Обед должен быть основным приёмом пищи. В обед можно выпить стакан прохладной воды, съесть салат, кашу с умеренным количеством масла, хлеб. Ужин должен быть лёгким. Перед сном желательно выпить стакан тёплого молока с мёдом и специями: куркумой, кардамоном, фенхелем и мускатным орехом. \n\n" +
                "\n\t Рекомендации по продуктам: \n\n" +
                "•\t\t\t Салаты из свежих овощей и зелени хорошо уравновешивают Питту. \n\n" +
                "•\t\t\t Рекомендуются сладкие и спелые фрукты. Следует избегать употребления кислых фруктов, а также кислых и острых овощей (помидоры, редис, лук). \n\n" +
                "•\t\t\t Молочные и кисло-молочные продукты должны быть в основе рациона. Но следует в ограниченных количествах употреблять кефир и йогурт, особенно в холодное время года. \n\n" +
                "•\t\t\t продукты, семена, травяные чаи, кокос, миндаль, в небольшом количестве растительные масла. \n\n" +
                "•\t\t\t Рекомендуется употреблять охлаждающие специи (кардамон, кориандр, шафран, фенхель), свежую зелень (петрушка, укроп, базилик, кинза, мята), свежий имбирь. Избегать острых специй - все виды острого перца, сухой имбирь, гвоздика, горчица. \n\n" +
                "•\t\t\t Очень важно ежедневно употреблять достаточное количество воды. \n\n" +
                "\n\t Избыток Питты повышает кислотность в организме. Стоит исключить сухую, пережаренную и слишком жирную пищу, острые специи, кетчуп, майонез и продукты брожения в частности дрожжевой хлеб. Следует минимизировать употребление солений, маринадов, консервов. Употреблять в меру следует пищу с острым, солёным и горьким вкусом. \n\n"
        ,
        "\n\t Капха-Доша \n\n" +
                "\n\t Капха-Доша - самая медлительная, но и самая устойчивая из всех. Она менее других склонна выходить из равновесия, однако, если же это всё-таки происходит, Капху крайне сложно привести в равновесие. Капхе необходимо постоянно соблюдать специальную диету. \n\n" +
                "\n\t Несмотря на то, что Аюрведа считает Капху-Дошу более устойчивой по сравнению с Ватой и Питтой, в современном мире наблюдается обратная картина. Посмотреть на западный мир, так там каждый третий страдает от ожирения, что является ярким примером разбалансированности Капха-Доши. Сюда же можно отнести насморк, простудные заболевания и диабет. \n\n" +
                "\n\t Физиологический портрет\n\n" +
                "\n\t У людей Капха-типа тело обычно хорошо развито, однако они склонны к излишнему весу. Люди Капха-типа отличаются широкой грудью, развитыми мышцами, сравнительно короткими ногами, полными руками. \n\n" +
                "\n\t Кожа у Капхи обычно бледная, мягкая, гладкая, влажная и жирная. Морщины появляются очень поздно. Волосы - густые, мягкие, волнистые, чаще тёмные. Ресницы густые. Глаза большие, чёрные или голубые. Губы полные. \n\n" +
                "\n\t Типичная женщина Капха-типа имеет округлые, полные формы, немного коротковатые ноги. Она источает грациозность, неторопливость и уверенность в себе. Мужчину этого типа отличает развитая мускулатура, мощный корпус, широкие плечи и бёдра. \n\n" +
                "\n\t Аппетит у Капхи слабый, процесс пищеварения происходит медленно. Едят Капхи меньше других типов. Двигаются они медленно, потоотделение - умеренное. Спят крепко и долго, часто пересыпают. Капхи выносливы, часто отличаются крепким здоровьем. \n\n" +
                "\n\t Психологический портрет\n" +
                "\n\t Люди Капха-типа чаще всего спокойны, терпимы, стабильны, уверенны в себе. Они характеризуется инертностью, малоподвижностью, леностью, чувственностью и устойчивостью. Такие люди не склонны попусту растрачивать энергию, которую предпочитают расходовать бережно и аккуратно. Новое они усваивают медленно, но уверенно. Знания закрепляются прочно и надолго. \n\n" +
                "\n\t Люди со сбалансированной Капхой – приятные собеседники, они добродушны и миролюбивы, легко прощают. Они всегда уважают чувства и мнения других людей, способны слушать и сострадать, трезво мыслить и с пониманием относиться к окружающим. Капха терпелива и её крайне сложно вывести из себя. Она размеренна, никогда не спешит, рассудительна, консервативна и адекватно оценивает свои возможности и не «распыляется» на сотни дел. \n\n" +
                "\n\t Эта Доша источает внутреннюю силу, к которой так стремится Вата и Питта. \n\n" +
                "\n\t Питание\n\n" +
                "\n\t Капха – влажная и холодная. Для её равновесия необходимо употреблять продукты с противоположным свойством – сухим и тёплым. Основу рациона должна составлять согревающая, лёгкая, низкокалорийная и мягкая пища. Капху увеличивает сладкий вкус и, в меньшей степени, кислый и солёный. Уменьшают Капху острый, терпкий и горький вкусы. Следует избегать старой, пережаренной, жирной, водянистой, очень холодной и очень горячей пищи, дрожжевого хлеба и алкоголя. \n\n" +
                "\n\t Люди Капха-типа любят вкусно и плотно поесть, однако ей больше других Дош следует следить за рационом и, особенно, за его объёмом, поскольку она имеет слабое пищеварение. Капхе желательно питаться по часам и ограничиться двухразовым питанием - в полдень и вечером. \n\n" +
                "\n\t Затрак Капхе можно заменить стаканом тёплой, но не горячей, воды с имбирём, соком лимона и мёдом. На обед желательно покушать обильно. Пища должна быть сытной и питательной с большим количеством овощей, обильно сдобренных специями. Ужин должен быть как можно более лёгким и не позднее 18 часов, т.к. после этого времени пища усваивается с трудом. Капхам вредно употреблять сладкое вечером. Это приводит к обильному выделению слизи, и на утро будет забита носоглотка. Худший выбор для Капхи - мороженое. \n\n" +
                "\n\t Люди Капха-типа спокойно переносят голодания, в отличие от Ваты и Питты. \n\n" +
                "\n\t Рекомендации по продуктам: \n\n" +
                "•\t\t\t Жидкости употреблять понемногу, т. к. они ослабляют огонь пищеварения, который у Капхи и без того подавлен. Полезен горячий напиток с имбирём и лимоном. \n\n" +
                "•\t\t\t Овощи лучше употреблять в варёном или тушёном виде. \n\n" +
                "•\t\t\t Хорошо подходят фрукты с вяжущим вкусом: хурма, гранаты, яблоки, клюква, вишни. В большей степени рекомендуется употреблять сухофрукты, чтобы сократить количество потребляемой влаги. \n\n" +
                "•\t\t\t Полезны зерновые и бобовые. \n\n" +
                "•\t\t\t Орехи и семена лучше исключить. \n\n" +
                "•\t\t\t В ограниченном количестве употреблять молочные и кисломолочные продукты. \n\n" +
                "•\t\t\t Капхам полезно добавлять в еду много специй и трав. Практически все специи благоприятно воздействуют на Капху. Следует лишь ограничить потребление соли. \n\n" +
                "•\t\t\t Масла употреблять в очень ограниченных количествах. \n\n"
        ,
    )



    override val addDescriptionList: Array<String> = arrayOf()

}