package com.totems.totemanimals.resoursesTests

import com.totems.totemanimals.R

object questionListDoshi {

    val im_background = R.drawable.doshi_background
    //лист с текстом вопросов
    val quest_totem_animal = arrayOf<String>(
        "Ваше телосложение?",
        "Ваша ширина бедер?",
        "Ваша ширина плеч?",
        "Какой у вас  тип кожи?",
        "Как вы ощущаете свою температуру тела?",
        "Какой  у вас тип зубов ?",
        "Какой у вас тип губ?",
        "Какой у вас тип пальцев?",
        "Где у вас скапливается жир ?",
        "Каков ваш рост?",
        "Какой у вас тип суставов?",
        "Насколько видны ваши вены?",
        "Какой у вас тип волос?",
        "Какая у вас форма лица?",
        "Какая у вас шея?",
        "Какая у вас форма носа?",
        "Какие у вас глаза?",
        "Какой у вас рот?",
        "Сильно ли вы потеете?",
        "Какова частота вашего пульса?",
        "Как вы относитесь к окружающей температуре?",
        "Какой у вас сон?",
        "Как часто и много вы хотите в туалет?(По маленькому)",
        "Какой у вас стул?",
        "Ваш уровень активности?",
        "Какая у вас походка?",
        "Какова ваша выносливость?",
        "Какой у вас голос?",
        "Какая у вас речь?",
        "Какой у вас аппетит?",
        "Как у вас проявлется жажда?",
        "Какую пищу вы предпочтете?",
        "Как вы оцениваете своё мышление?",
        "Какая у вас с память?",
        "Насколько устойчивы ваши убеждения?",
        "Как у вас обстоят дела с принятием решений?",
        "Какой тип расходования денег у вас?",
        "Каковы ваши интересы?",
        "Ваша творческая активность?",
        "Какие эмоции вы чаще переживаете?",
        "Какой у вас образ жизни?",


    )

    // лист с минимальным количеством ответов
    val min_nums_ans = arrayOf(1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,)

    // лист с количеством ответов-кнопок для каждого вопроса
    val answer_nums = arrayOf<Int>(3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,)

    //Лист начисляемых баллов для каждого ответа
    val answer_right_check = arrayOf<Array<Array<Int>>>( // 11 листов (кол-во вопросов) с 15 элементами (15 кнопок)
        //1 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
           ),
        //2 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //3 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //4 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //5 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //6 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //7 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //8 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //9 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //10 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //11 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //12 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //13 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //14 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //15 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //16 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //17 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //18 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //19 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //20 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //21 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //22 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //23 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //24 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //25 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //26 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //27 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //28 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //29 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //30 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //31 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //32 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //33 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //34 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //35 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //36 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //37 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //38 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //39 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //40 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //41 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
    )

    val button_name_list = arrayOf<Array<String>>( // 11 листов c ответами (кол_во кнопок- вариантов ответа)
        /*1 вопрос*/ arrayOf(" худое и хрупкое телосложение"," среднее телосложение"," тело склонно к полноте, мышцы хорошо развиты","","","","","","","","","","","","",),
        /*2 вопрос*/ arrayOf("узкие"," средние","широкие","","","","","","","","","","","","",),
        /*3 вопрос*/ arrayOf("узкие"," средние","широкие","","","","","","","","","","","","",),
        /*4 вопрос*/ arrayOf("сухая, темноватая","желтоватая, много потеете, веснушки, родинки","блестит и лоснится, белая","","","","","","","","","","","","",),
        /*5 вопрос*/ arrayOf(" низкая, холодные конечности","высокая, ощущение теплоты","низкая, прохладная на ощупь","","","","","","","","","","","","",),
        /*6 вопрос*/ arrayOf("нерегулярные, маленькие, легко ломаются","желтоватые, средние"," белые, большие, крепкие","","","","","","","","","","","","",),
        /*7 вопрос*/ arrayOf(" тонкие, тёмные, сухие, потрескавшиеся","мягкие, розовые или медного цвета"," толстые, полные, влажные","","","","","","","","","","","","",),
        /*8 вопрос*/ arrayOf("длинные и тонкие","средние"," толстые и относительно короткие","","","","","","","","","","","","",),
        /*9 вопрос*/ arrayOf(" в основном в области живота и талии"," распределён равномерно","в основном вокруг бёдер и ягодиц","","","","","","","","","","","","",),
        /*10 вопрос*/ arrayOf("очень низкий или очень высокий (и худое тело)","средний"," высокий или низкий (и тучное тело)","","","","","","","","","","","","",),
        /*11 вопрос*/ arrayOf("выступающие, сухие, узловатые"," нормальные, соразмерные","большие, хорошо сформированные, округлённые","","","","","","","","","","","","",),
        /*12 вопрос*/ arrayOf("легко заметные"," равномерно распределённые","не видны","","","","","","","","","","","","",),
        /*13 вопрос*/ arrayOf("тонкие, тёмные, грубые, курчавые или вьющиеся"," красивые, мягкие, прямые, светлые, рыжеватые или песчаные","густые, толстые, волнистые, блестящие, чёрные или коричневые","","","","","","","","","","","","",),
        /*14 вопрос*/ arrayOf("вытянутое, угловатое, подбородок часто слаборазвитый","сердцевидное, подбородок часто заострённый","большое, округлое, полное","","","","","","","","","","","","",),
        /*15 вопрос*/ arrayOf("тонкая, очень длинная или очень короткая","средняя, пропорциональная","широкая, мощная","","","","","","","","","","","","",),
        /*16 вопрос*/ arrayOf("маленький, узкий, нос с горбинкой"," средний, ровный, заострённый","большой, округлый, нос картошкой","","","","","","","","","","","","",),
        /*17 вопрос*/ arrayOf("маленькие, узкие, запавшие, тёмно-коричневые или серые, тусклые","средние, светло-синие, светло-серые или карие, выразительные","большие, навыкате, синие или светло-коричневые, привлекательные","","","","","","","","","","","","",),
        /*18 вопрос*/ arrayOf("маленький","средний","большой","","","","","","","","","","","","",),
        /*19 вопрос*/ arrayOf("минимально"," обильно, лоснящийся или кисло пахнущий","умеренно, присутствующий всегда","","","","","","","","","","","","",),
        /*20 вопрос*/ arrayOf(" слабый, частый (80-100), изменчивый"," сильный, наполненный, средний (70-80)","устойчивый, редкий (60-70), ритмичный","","","","","","","","","","","","",),
        /*21 вопрос*/ arrayOf("  сильно стремитесь к теплу","  любите прохладу","  не любите холод","","","","","","","","","","","","",),
        /*22 вопрос*/ arrayOf("  лёгкий, прерывистый","  крепкий, короткий","  глубокий, любите много спать","","","","","","","","","","","","",),
        /*23 вопрос*/ arrayOf("  небольшое количество, но часто","  среднее количество, относительно часто","  большое количество, редко","","","","","","","","","","","","",),
        /*24 вопрос*/ arrayOf("  нерегулярный, склонность к запорам, твёрдый, сухой","  регулярный, рыхлый","  тягучий, обильный, тяжёлый","","","","","","","","","","","","",),
        /*25 вопрос*/ arrayOf("  очень высокий, неугомонный","  умеренный","  вялый, мечтательный","","","","","","","","","","","","",),
        /*26 вопрос*/ arrayOf("  скорее быстрая","  со средней скоростью","  скорее медленная","","","","","","","","","","","","",),
        /*27 вопрос*/ arrayOf("  быстро истощаетесь, необходимо время на восстановление","  хорошо управляемая","  хорошая жизнеспособность и выносливость","","","","","","","","","","","","",),
        /*28 вопрос*/ arrayOf("  тихий, слабый","  резкий, зычный","  мягкий, ласкающий слух","","","","","","","","","","","","",),
        /*29 вопрос*/ arrayOf("  быстрая, словоохотливая","  острая, ясная, точная","  медленная, возможно затруднённая","","","","","","","","","","","","",),
        /*30 вопрос*/ arrayOf("  изменчивый, непостоянный","  очень хороший","  умеренный","","","","","","","","","","","","",),
        /*31 вопрос*/ arrayOf("  изменчивая, непостоянная","  часто испытываемая","  не замечаемая","","","","","","","","","","","","",),
        /*32 вопрос*/ arrayOf("  тёплая, горячая, сырая пища со сладким, кислым или солёным вкусом","  очень холодная, сладкая, горькая и вяжущая","  слегка тёплая, кислая и вяжущая","","","","","","","","","","","","",),
        /*33 вопрос*/ arrayOf("  поверхностное, меняющееся, слабо применяющееся на практике","  точное, логическое, хорошее планирующее и исполняющее","  спокойное, медленное, стабильное, организованное","","","","","","","","","","","","",),
        /*34 вопрос*/ arrayOf("  быстро запоминающая, плохо удерживающая","  быстро запоминающая, хорошо удерживающая длительное время","  медленно запоминающая, хорошо удерживающая","","","","","","","","","","","","",),
        /*35 вопрос*/ arrayOf("  часто меняющиеся","  чрезвычайно сильные убеждения","  глубокие, устойчивые, неизменные","","","","","","","","","","","","",),
        /*36 вопрос*/ arrayOf("  проблематичное","  быстрое, решительное","  тщательно продуманное","","","","","","","","","","","","",),
        /*37 вопрос*/ arrayOf("  расточительное и неэкономное","  методичное","  экономное, бережливое","","","","","","","","","","","","",),
        /*38 вопрос*/ arrayOf("  путешествия, искусство, эзотерика","  спорт, политика, предметы роскоши","  покой, бизнес, хорошая пища","","","","","","","","","","","","",),
        /*39 вопрос*/ arrayOf("  ярко выраженная и богатая идеями","  в основном связана с научными или техническими изобретениями","  преимущественно в области бизнеса","","","","","","","","","","","","",),
        /*40 вопрос*/ arrayOf("  опасение, беспокойство, сомнение, неуверенность и стеснительность","  сердитость, критика, амбиции, практичность, завистливость","  забота, быстрое восстановление хорошего настроения, самоудовлетворённость, апатия","","","","","","","","","","","","",),
        /*41 вопрос*/ arrayOf("  беспорядочный","  занятый, большие планы","  стабильный, размеренный","","","","","","","","","","","","",),


    )

}