package com.totems.totemanimals.resoursesTests

import com.totems.totemanimals.R

object questionListDoshi {

    val im_background = R.drawable.doshi_background
    //лист с текстом вопросов
    val quest_totem_animal = arrayOf<String>(
        "Ваше телосложение?",
        "Ваша ширина бедер?",
        "Ваша ширина плеч?",
        "Какой у вас  тип кожи?",
        "Как вы ощущаете свою температуру тела?",
        "Какой  у вас тип зубов ?",
        "Какой у вас тип губ?",
        "Какой у вас тип пальцев?",
        "Где у вас скапливается жир ?",
        "Каков ваш рост?",
        "Какой у вас тип суставов?",
        "Насколько видны ваши вены?",
        "Какой у вас тип волос?",
        "Какая у вас форма лица?",
        "Какая у вас шея?",
        "Какая у вас форма носа?",
        "Какие у вас глаза?",
        "Какой у вас рот?",
        "Сильно ли вы потеете?",
        "Какова частота вашего пульса?",
        "Как вы относитесь к окружающей температуре?",
        "Какой у вас сон?",
        "Как часто и много вы хотите в туалет?(По маленькому)",
        "Какой у вас стул?",
        "Ваш уровень активности?",
        "Какая у вас походка?",
        "Какова ваша выносливость?",
        "Какой у вас голос?",
        "Какая у вас речь?",
        "Какой у вас аппетит?",
        "Как у вас проявлется жажда?",
        "Какую пищу вы предпочтете?",
        "Как вы оцениваете своё мышление?",
        "Какая у вас с память?",
        "Насколько устойчивы ваши убеждения?",
        "Как у вас обстоят дела с принятием решений?",
        "Какой тип расходования денег у вас?",
        "Каковы ваши интересы?",
        "Ваша творческая активность?",
        "Какие эмоции вы чаще переживаете?",
        "Какой у вас образ жизни?",


    )

    // лист с минимальным количеством ответов
    val min_nums_ans = arrayOf(1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,)

    // лист с количеством ответов-кнопок для каждого вопроса
    val answer_nums = arrayOf<Int>(3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,)

    //Лист начисляемых баллов для каждого ответа
    val answer_right_check = arrayOf<Array<Array<Int>>>( // 11 листов (кол-во вопросов) с 15 элементами (15 кнопок)
        //1 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
           ),
        //2 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //3 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //4 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //5 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //6 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //7 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //8 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //9 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //10 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //11 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //12 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //13 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //14 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //15 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //16 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //17 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //18 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //19 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //20 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //21 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //22 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //23 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //24 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //25 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //26 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //27 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //28 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //29 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //30 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //31 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //32 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //33 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //34 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //35 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //36 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //37 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //38 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //39 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //40 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
        //41 вопрос
        arrayOf(
            arrayOf(1	,	0	,	0),
            arrayOf(0	,	1	,	0),
            arrayOf(0	,	0	,	1),
        ),
    )

    val button_name_list = arrayOf<Array<String>>( // 11 листов c ответами (кол_во кнопок- вариантов ответа)
        /*1 вопрос*/ arrayOf(" худое и хрупкое телосложение"," среднее телосложение"," тело склонно к полноте, мышцы хорошо развиты\n","","","","","","","","","","","","",),
        /*2 вопрос*/ arrayOf("узкие\n"," средние\n","широкие\n","","","","","","","","","","","","",),
        /*3 вопрос*/ arrayOf("узкие\n"," средние\n","широкие\n","","","","","","","","","","","","",),
        /*4 вопрос*/ arrayOf("сухая, темноватая\n","желтоватая, много потеете, веснушки, родинки\n","блестит и лоснится, белая\n","","","","","","","","","","","","",),
        /*5 вопрос*/ arrayOf(" низкая, холодные конечности\n","высокая, ощущение теплоты\n","низкая, прохладная на ощупь\n","","","","","","","","","","","","",),
        /*6 вопрос*/ arrayOf("нерегулярные, маленькие, легко ломаются\n","желтоватые, средние\n"," белые, большие, крепкие\n","","","","","","","","","","","","",),
        /*7 вопрос*/ arrayOf(" тонкие, тёмные, сухие, потрескавшиеся\n","мягкие, розовые или медного цвета\n"," толстые, полные, влажные\n","","","","","","","","","","","","",),
        /*8 вопрос*/ arrayOf("длинные и тонкие\n","средние\n"," толстые и относительно короткие\n","","","","","","","","","","","","",),
        /*9 вопрос*/ arrayOf(" в основном в области живота и талии\n"," распределён равномерно\n","в основном вокруг бёдер и ягодиц\n","","","","","","","","","","","","",),
        /*10 вопрос*/ arrayOf("очень низкий или очень высокий (и худое тело)\n","средний\n"," высокий или низкий (и тучное тело)\n","","","","","","","","","","","","",),
        /*11 вопрос*/ arrayOf("выступающие, сухие, узловатые\n"," нормальные, соразмерные\n","большие, хорошо сформированные, округлённые\n","","","","","","","","","","","","",),
        /*12 вопрос*/ arrayOf("легко заметные\n"," равномерно распределённые\n","не видны\n","","","","","","","","","","","","",),
        /*13 вопрос*/ arrayOf("тонкие, тёмные, грубые, курчавые или вьющиеся\n"," красивые, мягкие, прямые, светлые, рыжеватые или песчаные\n","густые, толстые, волнистые, блестящие, чёрные или коричневые\n","","","","","","","","","","","","",),
        /*14 вопрос*/ arrayOf("вытянутое, угловатое, подбородок часто слаборазвитый\n","сердцевидное, подбородок часто заострённый\n","большое, округлое, полное\n","","","","","","","","","","","","",),
        /*15 вопрос*/ arrayOf("тонкая, очень длинная или очень короткая\n","средняя, пропорциональная\n","широкая, мощная\n","","","","","","","","","","","","",),
        /*16 вопрос*/ arrayOf("маленький, узкий, нос с горбинкой\n"," средний, ровный, заострённый\n","большой, округлый, нос картошкой\n","","","","","","","","","","","","",),
        /*17 вопрос*/ arrayOf("маленькие, узкие, запавшие, тёмно-коричневые или серые, тусклые\n","средние, светло-синие, светло-серые или карие, выразительные\n","большие, навыкате, синие или светло-коричневые, привлекательные\n","","","","","","","","","","","","",),
        /*18 вопрос*/ arrayOf("маленький\n","средний\n","большой\n","","","","","","","","","","","","",),
        /*19 вопрос*/ arrayOf("минимально\n"," обильно, лоснящийся или кисло пахнущий\n","умеренно, присутствующий всегда\n","","","","","","","","","","","","",),
        /*20 вопрос*/ arrayOf(" слабый, частый (80-100), изменчивый\n"," сильный, наполненный, средний (70-80)\n","устойчивый, редкий (60-70), ритмичный\n","","","","","","","","","","","","",),
        /*21 вопрос*/ arrayOf("  сильно стремитесь к теплу\n","  любите прохладу\n","  не любите холод\n","","","","","","","","","","","","",),
        /*22 вопрос*/ arrayOf("  лёгкий, прерывистый\n","  крепкий, короткий\n","  глубокий, любите много спать\n","","","","","","","","","","","","",),
        /*23 вопрос*/ arrayOf("  небольшое количество, но часто\n","  среднее количество, относительно часто\n","  большое количество, редко\n","","","","","","","","","","","","",),
        /*24 вопрос*/ arrayOf("  нерегулярный, склонность к запорам, твёрдый, сухой\n","  регулярный, рыхлый\n","  тягучий, обильный, тяжёлый\n","","","","","","","","","","","","",),
        /*25 вопрос*/ arrayOf("  очень высокий, неугомонный\n","  умеренный\n","  вялый, мечтательный\n","","","","","","","","","","","","",),
        /*26 вопрос*/ arrayOf("  скорее быстрая\n","  со средней скоростью\n","  скорее медленная\n","","","","","","","","","","","","",),
        /*27 вопрос*/ arrayOf("  быстро истощаетесь, необходимо время на восстановление\n","  хорошо управляемая\n","  хорошая жизнеспособность и выносливость\n","","","","","","","","","","","","",),
        /*28 вопрос*/ arrayOf("  тихий, слабый\n","  резкий, зычный\n","  мягкий, ласкающий слух\n","","","","","","","","","","","","",),
        /*29 вопрос*/ arrayOf("  быстрая, словоохотливая\n","  острая, ясная, точная\n","  медленная, возможно затруднённая\n","","","","","","","","","","","","",),
        /*30 вопрос*/ arrayOf("  изменчивый, непостоянный\n","  очень хороший\n","  умеренный\n","","","","","","","","","","","","",),
        /*31 вопрос*/ arrayOf("  изменчивая, непостоянная\n","  часто испытываемая\n","  не замечаемая\n","","","","","","","","","","","","",),
        /*32 вопрос*/ arrayOf("  тёплая, горячая, сырая пища со сладким, кислым или солёным вкусом\n","  очень холодная, сладкая, горькая и вяжущая\n","  слегка тёплая, кислая и вяжущая\n","","","","","","","","","","","","",),
        /*33 вопрос*/ arrayOf("  поверхностное, меняющееся, слабо применяющееся на практике\n","  точное, логическое, хорошее планирующее и исполняющее\n","  спокойное, медленное, стабильное, организованное\n","","","","","","","","","","","","",),
        /*34 вопрос*/ arrayOf("  быстро запоминающая, плохо удерживающая\n","  быстро запоминающая, хорошо удерживающая длительное время\n","  медленно запоминающая, хорошо удерживающая\n","","","","","","","","","","","","",),
        /*35 вопрос*/ arrayOf("  часто меняющиеся\n","  чрезвычайно сильные убеждения\n","  глубокие, устойчивые, неизменные\n","","","","","","","","","","","","",),
        /*36 вопрос*/ arrayOf("  проблематичное\n","  быстрое, решительное\n","  тщательно продуманное\n","","","","","","","","","","","","",),
        /*37 вопрос*/ arrayOf("  расточительное и неэкономное\n","  методичное\n","  экономное, бережливое\n","","","","","","","","","","","","",),
        /*38 вопрос*/ arrayOf("  путешествия, искусство, эзотерика\n","  спорт, политика, предметы роскоши\n","  покой, бизнес, хорошая пища\n","","","","","","","","","","","","",),
        /*39 вопрос*/ arrayOf("  ярко выраженная и богатая идеями\n","  в основном связана с научными или техническими изобретениями\n","  преимущественно в области бизнеса\n","","","","","","","","","","","","",),
        /*40 вопрос*/ arrayOf("  опасение, беспокойство, сомнение, неуверенность и стеснительность\n","  сердитость, критика, амбиции, практичность, завистливость\n","  забота, быстрое восстановление хорошего настроения, самоудовлетворённость, апатия\n","","","","","","","","","","","","",),
        /*41 вопрос*/ arrayOf("  беспорядочный\n","  занятый, большие планы\n","  стабильный, размеренный\n","","","","","","","","","","","","",),


    )

    fun checkAllCountQuestion() : Boolean {
        return quest_totem_animal.count() == min_nums_ans.count() &&
                min_nums_ans.count() == answer_nums.count() &&
                answer_nums.count() == answer_right_check.count() &&
                answer_right_check.count() == button_name_list.count()
    }
}