package com.example.totemanimals

object list_resours {

    val imIdList = listOf(R.drawable.smallbelka,R.drawable.smallbober,R.drawable.smallezh,
        R.drawable.smallfilin,R.drawable.smallkon,R.drawable.smalllebed,R.drawable.smalllisa,
        R.drawable.smallmedved,R.drawable.smallolen,R.drawable.smallorel,R.drawable.smallpetuh,
        R.drawable.smallslon,R.drawable.smalltur,R.drawable.smalluzh,R.drawable.smallvolk,)


    val nameIdList = listOf("Белка","Бобёр","Ёж","Филин","Конь","Лебедь","Лисица","Медведь","Олень","Орёл","Петух","Слон","Тур","Уж","Волк",)

    val descriptIdList = listOf(
        "О книге\n" +
                "\n" +
                "Когда я собрался погрузиться в разработку Android, я не смог найти в сети толковых материалов для новичков на русском языке. Думаю, этот факт оттолкнул многих желающих начать изучение.\n" +
                "Поэтому я решил этим желающим помочь.\n" +
                "\n" +
                "Я создал сайт startandroid.ru и начал излагать там те темы, которые сам уже изучил. Материал на\n" +
                "сайте представлен в виде небольших последовательных уроков. Каждый урок сопровожден примером, который раскрывает тему, и наглядными скриншотами.\n" +
                "\n" +
                "От читателей периодически поступали просьбы сделать уроки доступными офлайн. Поэтому я скомпоновал первые 100 уроков в этот сборник.\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "О чем книга\n" +
                "\n" +
                "Книга научит вас разрабатывать приложения для Android. Начнем с установки среды разработки и запуска первого приложения. Научимся компоновать экраны, обрабатывать нажатия и создавать свое меню. После этого вы уже способны сами написать несложное приложение.\n" +
                "\n" +
                "Ну а далее пойдут базисные темы: несколько экранов, диалоги, вкладки, списки, настройки, работа с данными, фоновые задачи, уведомления.\n" +
                "\n" +
                "Все темы рассмотрены в разрезе Android 2.X. Новшества третьей версии не вошли в этот сборник.\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "Для кого книга\n" +
                "\n" +
                "Книга рассчитана на абсолютных новичков в Android, но знакомых с Java. Также понадобятся знания XML и SQL.\n" +
                "\n" +
                "После прочтения вы вплотную приблизитесь к среднему уровню разработчика. С этим запасом знаний вы сами сможете свободно продолжать изучение с помощью других источников, и расти дальше.\n" +
                "\n" +
                "\n",
        "two",
        "three",
        "four",
        "five",
        "six",
        "seven",
        "eigth",
        "nine",
        "ten",
        "eleven",
        "twelf",
        "1three",
        "1four",
        "1five",)

}