package com.example.totemanimals

object questionListsTotemAnimal {
    //лист с текстом вопросов
    val quest_totem_animal = listOf("первый","второй","третий","четвертый","пятый","шестой","седьмой",
        "восьмой","девятый","десятый","одинадцатый","двенадцатый","тринадцатый",)
    // лист с количеством ответов для каждого вопроса
    val answer_num = listOf<Int>(4,4,14,3,3,3,3,3,5,8,3,5,9,)
    //Лист начисляемых баллов для каждого ответа
    val answer_right_check = listOf<List<Int>>(
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,),
            )


    //нужен лист названий ответов для биндинга кнопок
}