package com.example.totemanimals

object questionListsTotemAnimal {
        //лист с текстом вопросов
    val quest_totem_animal = listOf("первый","второй","третий","четвертый","пятый","шестой","седьмой",
        "восьмой","девятый","десятый","одинадцатый","двенадцатый","тринадцатый",)

    // лист с количеством ответов для каждого вопроса
        val answer_num = listOf<Int>(4,4,14,3,3,3,3,3,5,8,3,5,9,)

    //Лист начисляемых баллов для каждого ответа
        val answer_right_check = listOf<List<Int>>( // 13 листов (кол-во вопросов) с 15 элементами (Количество Тотемных зверей)
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
            )

    val button_name_list = listOf<List<String>>( // 13 листов по 15 (кол_во кнопок- вариантов ответа)
        listOf("1","2","3","4","","","","","","","","","","","",),
        listOf("1","2","3","4","","","","","","","","","","","",),
        listOf("1","2","3","4","5","6","7","8","9","10","11","12","13","14","",),
        listOf("1","2","3","","","","","","","","","","","","",),
        listOf("1","2","3","","","","","","","","","","","","",),
        listOf("1","2","3","","","","","","","","","","","","",),
        listOf("1","2","3","","","","","","","","","","","","",),
        listOf("1","2","3","","","","","","","","","","","","",),
        listOf("1","2","3","4","5","","","","","","","","","","",),
        listOf("1","2","3","4","5","6","7","8","","","","","","","",),
        listOf("1","2","3","","","","","","","","","","","","",),
        listOf("1","2","3","4","5","","","","","","","","","","",),
        listOf("1","2","3","4","5","6","7","9","","","","","","","",),


    )
}