package com.example.totemanimals

object questionListsTotemAnimal {
        //лист с текстом вопросов
    val quest_totem_animal = listOf("Какой чувственный аспект вам ближе?",
            "В какое время дня вы чувствуете наибольшую активность?",
            "Какая черта характера вас наиболее охарактеризует?",
            "Какая у вас комплекция тела?",
            "Какой тип личности характеризует вас в большей степени?",
            "Какую пищу вы предпочитаете?",
            "Какой тип характера подходит вам в большей степени?",
            "Как вы предпочитаете отдыхать?",
            "Кто вы по натуре?",
            "Чего вы хотите от жизни?",
            "Чего вы боитесь в жизни?",
            "Куда вы поедете отдыхать если будет такая возможность?",
            "Ваша, самая мешающая вам жить, отрицательная черта характера?",)

    // лист с количеством ответов для каждого вопроса
        val answer_num = listOf(4,4,14,3,3,3,3,3,5,8,3,5,9,)

    //Лист начисляемых баллов для каждого ответа
        val answer_right_check = listOf<List<Int>>( // 13 листов (кол-во вопросов) с 15 элементами (Количество Тотемных зверей)
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
        listOf(0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,),
            )

    val button_name_list = listOf<List<String>>( // 13 листов по 15 (кол_во кнопок- вариантов ответа)
        listOf("Вода - Вкус","Воздух - Осязание","Земля - Запах","Огонь - Зрение","","","","","","","","","","","",),
        listOf("Вечер","Ночь","Утро","День","","","","","","","","","","","",),
        listOf("Смелость","Мудрость","Доброта",
            "Хитрость","Запасливость","Упрямство","Коварство","Наглость",
            "Верность","Гордость","Целеустремленность","Уверенность","Осторожность","Наблюдательность","",),
        listOf("Развитая мышечная масса, атлетическое телосложение",
            "Крепкое тело, есть склонность к полноте",
            "Худоба, утонченная фигура, мало жировой массы","","","","","","","","","","","","",),
        listOf("Деятель","Интелектуал","Эстет","","","","","","","","","","","","",),
        listOf("Острая, пряная пиша, цитрусовые, ферментированные продукты",
            "Сухая пища, сухофрукты, овощи, фрукты, обезжиренная молочная продукция, орехи",
            "Мясо, зерновые продукты, каши, выпечка, молочные продукты","","","","","","","","","","","","",),
        listOf("Замкнутый","Обычный, сбалансированный между замкнутостью и эгоизмом","Эгоцентричный(Ставите превыше всего себя)","","","","","","","","","","","","",),
        listOf("Путешествовать, посещать новые места",
            "Предпочитаю смену деятельности, помогает переключиться на что-то новое, отдохнуть от старого",
            "Сидеть дома, заниматься домашними делами","","","","","","","","","","","","",),
        listOf("Охотник","Работяга","Бродяга","Лидер","Мыслитель","","","","","","","","","","",),
        listOf("Развлечений","Семью","Денег","Знаний","Здоровья","Известности","Свободы","Власти","","","","","","","",),
        listOf("Одиночества","Предательства","Изменений","","","","","","","","","","","","",),
        listOf("В лес, с палаткой, охота, рыбалка, по грибы",
            "В деревню","Город, останусь в городе или поеду в другой город","В необычные места, например в горы","На море","","","","","","","","","","",),
        listOf("Агрессивность","Щедрость","Обидчивость","Зависть","Недоверчивость","Лень","Жадность","Доверчивость","Лживость","","","","","","",),


    )
}